import random

number = 0
i = 0
music = ["","1.떡잎마을","2.잔모레마을","3.축복시티","4.무쇠시티",
			"5.꽃향기마을","6.영원시티","7.연고시티","8.신수마을",
			"9.장막시티","10.운하시티", "11. 선단시티","12.들판시티",
			"13. 봉신마을", "14. 물가시티","15.입지호수근처",
		]


def nodding(n):
	print("==============================")
	print("%d번트랙이 실행됩니다. %s.mps재생중..."%(n, music[n]))
	print("아 이거 좋아.")
	print(" 정거니가 좋아서 미쳐날뜁니다.")
	print(" 고개를 %s"%("까딱 "*(n)))
	print("==============================")

while i<10:
	i += 1
	number = int(input("재생을 원하시는 트랙번호를 입력하세요 :"))
	if number > 15:
		print("해당 트랙이 없습니다.")
		break
	nodding(number)
